upgrate_data_wage/high_dim/vel6.3939393939393945/system/blockMeshDict.low
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.15242 0       -0.005)
    ( 0       0       -0.005)
    ( 0.3048  0.081670913853  -0.005)
    (-0.15242 0.1524 -0.005)
    ( 0       0.1524 -0.005)
    ( 0.3048  0.1524 -0.005)

    (-0.15242 0        0.005)
    ( 0       0        0.005)
    ( 0.3048  0.081670913853 0.005)
    (-0.15242 0.1524  0.005)
    ( 0       0.1524  0.005)
    ( 0.3048  0.1524  0.005)

);

blocks
(
    hex (0 1 4 3 6 7 10 9 ) (5 5 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) (10 5 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 7 6)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 9 10 4)
            (4 10 11 5)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (1 2 8 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
